Tekla Open API Reference for Tekla Structures 2025
Seam.SetSecondaryObjects Method
 Sets the secondary objects.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetSecondaryObjects(
	ArrayList Secondaries
)
Public Function SetSecondaryObjects (
	Secondaries As ArrayList
) As Boolean
Parameters
Secondaries
Type: System.Collections.ArrayList
An array list containing all the secondary objects.
Return Value
Type: Boolean
True on success.
See Also
Reference
Seam Class
Tekla.Structures.Model Namespace